# YOLOv10s Optimized for VisDrone (3-Layer Pre-Detect ECA)
# Sharpens channel features right before the classification and regression heads.

nc: 11  # Furnas dataset classes
scales:
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]               # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]              # 1  P2/4
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3  P3/8
  - [-1, 6, C2f, [256, True]]              # 4  <- P3 features
  - [-1, 1, SCDown, [512, 3, 2]]            # 5  P4/16
  - [-1, 6, C2f, [512, True]]              # 6  <- P4 features
  - [-1, 1, SCDown, [1024, 3, 2]]           # 7  P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 1, PSA, [1024]]                   # 10

head:
  # --- Top-down path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11  upsample P5
  - [[-1, 6], 1, Concat, [1]]                   # 12  cat backbone P4
  - [-1, 3, C2f, [512]]                         # 13  P4 fusion features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14  upsample P4
  - [[-1, 4], 1, Concat, [1]]                   # 15  cat backbone P3
  - [-1, 3, C2f, [256]]                         # 16  P3 fusion features
  - [-1, 1, ECA, [3]]                           # 17  <--【新增】P3 預測頭前通道清洗

  # --- Bottom-up path ---
  - [-1, 1, Conv, [256, 3, 2]]                  # 18  downsample P3 (輸入來自層級 17 的 ECA)
  - [[-1, 13], 1, Concat, [1]]                  # 19  cat P4 fusion features
  - [-1, 3, C2f, [512]]                         # 20  P4 detection features
  - [-1, 1, ECA, [3]]                           # 21  <--【新增】P4 預測頭前通道清洗

  - [-1, 1, SCDown, [512, 3, 2]]                # 22  downsample P4 (輸入來自層級 21 的 ECA)
  - [[-1, 10], 1, Concat, [1]]                  # 23  cat backbone P5
  - [-1, 3, C2fCIB, [1024, True, True]]         # 24  P5 detection features
  - [-1, 1, ECA, [3]]                           # 25  <--【新增】P5 預測頭前通道清洗

  - [[17, 21, 25], 1, v10Detect, [nc]]          # 26  Detect(P3, P4, P5) 接收三個 ECA 的精煉特徵
