# YOLOv10s + CoordAtt inline at P3/P4/P5 detection features
# Same positions as CBAM version: output flows downstream (往下) and to head (往後).
#   P3 CoordAtt (layer 17): → Conv downsample + detect P3
#   P4 CoordAtt (layer 21): → SCDown + detect P4
#   P5 CoordAtt (layer 25): → detect P5 only
#
# Channel counts after width scaling (s: width=0.50):
#   C2f [256]     → 128 ch → CoordAtt(128) at layer 17
#   C2f [512]     → 256 ch → CoordAtt(256) at layer 21
#   C2fCIB [1024] → 512 ch → CoordAtt(512) at layer 25

nc: 11  # Furnas electrical equipment classes
scales:
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]               # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]              # 1  P2/4
  - [-1, 3, C2f, [128, True]]               # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3  P3/8
  - [-1, 6, C2f, [256, True]]               # 4  <- P3 features
  - [-1, 1, SCDown, [512, 3, 2]]            # 5  P4/16
  - [-1, 6, C2f, [512, True]]               # 6  <- P4 features
  - [-1, 1, SCDown, [1024, 3, 2]]           # 7  P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 1, PSA, [1024]]                   # 10

head:
  # --- Top-down path (unchanged) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 3, C2f, [512]]                         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 3, C2f, [256]]                         # 16  P3 top-down fusion

  - [-1, 1, CoordAtt, [128]]                    # 17  CA P3 → downsample + detect P3

  # --- Bottom-up path ---
  - [-1, 1, Conv, [256, 3, 2]]                  # 18  downsample from CA P3
  - [[-1, 13], 1, Concat, [1]]                  # 19
  - [-1, 3, C2f, [512]]                         # 20  P4 detection features

  - [-1, 1, CoordAtt, [256]]                    # 21  CA P4 → SCDown + detect P4

  - [-1, 1, SCDown, [512, 3, 2]]                # 22  downsample from CA P4
  - [[-1, 10], 1, Concat, [1]]                  # 23
  - [-1, 3, C2fCIB, [1024, True, True]]         # 24  P5 detection features

  - [-1, 1, CoordAtt, [512]]                    # 25  CA P5 → detect P5

  - [[17, 21, 25], 1, v10Detect, [nc]]          # 26  Detect(P3, P4, P5)
