# YOLOv10s + CBAM in Neck (P3 only) — Ablation variant
# Only CBAM at P3 detection output (layer 17).
# Use this to isolate the contribution of P3 CBAM vs full (P3+P4).
#
# Detection outputs: P3=layer17, P4=layer20, P5=layer23

nc: 80
scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0
  - [-1, 1, Conv, [128, 3, 2]]              # 1
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3
  - [-1, 6, C2f, [256, True]]              # 4  <- P3 features
  - [-1, 1, SCDown, [512, 3, 2]]            # 5
  - [-1, 6, C2f, [512, True]]              # 6  <- P4 features
  - [-1, 1, SCDown, [1024, 3, 2]]           # 7
  - [-1, 3, C2fCIB, [1024, True, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 1, PSA, [1024]]                   # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 3, C2f, [512]]                         # 13  P4 fusion (no CBAM here)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 3, C2f, [256]]                         # 16
  - [-1, 1, CBAM, [128]]                        # 17  CBAM on P3 only <- detect P3

  - [-1, 1, Conv, [256, 3, 2]]                  # 18
  - [[-1, 13], 1, Concat, [1]]                  # 19  cat layer 13 (no CBAM on P4)
  - [-1, 3, C2f, [512]]                         # 20  <- detect P4

  - [-1, 1, SCDown, [512, 3, 2]]                # 21
  - [[-1, 10], 1, Concat, [1]]                  # 22
  - [-1, 3, C2fCIB, [1024, True, True]]         # 23  <- detect P5

  - [[17, 20, 23], 1, v10Detect, [nc]]          # 24  Detect(P3, P4, P5)
